# В первом параметре ожидаем название фермы, 
# а в последующих - названия сельскохозяйственных культур.
def boasting(farm_name, *args):
    print(type(args))
    # Изменим строку и добавим название фермы:
    print('На ферме', farm_name, 'на грядках растёт', args)
    
# Сделаем вызов с несколькими аргументами. Первым - название фермы:
boasting('Овощной Клондайк', 'тыква', 'ананас', 'картошка', 'турнепс')

# Параметр *args означает, что функция готова принять несколько аргументов -
# неопределённое их число.
def boasting1(*args):
    # В теле функции обрабатываем параметр args (здесь уже без звёздочки!).
    # Выясним, какого типа данные переданы в тело функции:
    print(type(args))
    # Как и прежде, напечатаем строку, ради которой и создана эта функция:
    print('Теперь у меня на грядке растёт', args)
    

# Вызовем функцию с одним аргументом:
boasting1('арбуз')

# А теперь сделаем вызов с несколькими аргументами,
# перечисленными через запятую:
boasting1('тыква', 'ананас', 'картошка', 'турнепс')

# Вызовем функцию без аргументов:
boasting1()