print(str.format('{0} имеют {1} {2}.', 'огурцы', 'неповторимый', 'вкус'))
#                                         |           |             |
# Номера аргументов:                      0           1             2

# Будет напечатано: огурцы имеют неповторимый вкус.

# Можно переставить слова местами, изменив числа в фигурных скобках:
print(str.format('{2} имеют {0} {1}', 'огурцы', 'неповторимый', 'вкус'))
# Будет напечатано: вкус имеют огурцы неповторимый.

# Можно использовать не явные значения, а переменные:
first = 'кабачки'
second = 'вид'
third = 'ужасный'

print(str.format('{first} имеют {second} {third}.', first=first, second=second, third=third))
# Будет напечатано: кабачки имеют вид ужасный.

# Если значения в строке выводятся в том же порядке,
# в каком они перечислены в аргументах,
# число в фигурных скобках можно не указывать.
present = 'подарок'
print(str.format('Лучший {} на Новый год - это {}!', present, first))
# Будет напечатано: Лучший подарок на Новый год - это кабачки!

today = 'понедельник'
weight = 0.53908

# Вывести значение weight в исходном виде:
print(str.format('Сегодня {1}, а вы уже потратили {0} кг удобрений.', weight, today))
# Будет напечатано: Сегодня понедельник, а вы уже потратили 0.53908 кг удобрений.

# Вывести значение weight, округлённое до сотых долей:
print(str.format('Сегодня {1}, а вы уже потратили {0:.2f} кг удобрений.', weight, today))
# Будет напечатано: Сегодня понедельник, а вы уже потратили 0.54 кг удобрений.

# Если в фигурных скобках порядковый номер значения не указан,
# параметры для преобразований записывают, начиная с двоеточия.
# Для разнообразия округлим результат до четырёх знаков в дробной части:
print(str.format('Сегодня вы потратили {:.4f} кг удобрений.', weight, today))
# Будет напечатано: Сегодня вы потратили 0.5391 кг удобрений.


part_of_stocks = 0.6575649
# Преобразовать десятичную дробь в проценты 
# и округлить до двух знаков после запятой:
print(str.format('От зимних запасов осталось {:.2%}.', part_of_stocks))
# Будет напечатано: От зимних запасов осталось 65.76%.