vegetable_s = ['Помидоры', 'Огурцы', 'Перец']

# Внешний цикл, он перебирает коллекцию vegetables:
for vegetable in vegetable_s:
    print(vegetable)  # Печатаем каждый элемент.
    # Элементы списка vegetables - это строки, а строка - коллекция.
    # Переберём эту коллекцию во вложенном цикле и напечатаем построчно элементы
    # этой коллекции:
    for letter in vegetable:
        print(letter)
    # Отметим конец итерации внешнего цикла сообщением.
    # Эта строчка кода написана с отступом, она вложена в тело внешнего цикла,
    # но выполнится после того, как отработает вложенный цикл.
    print('Конец итерации внешнего цикла\n')
    # Символы \n переносят строку при печати в терминале.
    
retailers = ['Pixi', 'Двоечка', 'Жёлтое и зелёное', 'Экология вкуса', 'Вкусняшка']
vegetables = ['Помидоры', 'Огурцы', 'Брюква', 'Баклажаны', 'Патиссоны']

for retailer in retailers:
    print(retailer)
    # Объявляем вложенный цикл. Он будет запускаться на каждой итерации внешнего цикла.
    for vegetable in vegetables:
        # Во вложенном цикле можно обрабатывать и переменные из внешнего цикла!
        # В конце строки ещё раз напечатаем название торговой сети.
        print(f'- {vegetable} для сети «{retailer}»')

# После выполнения цикла будет напечатано сообщение:
print('Погрузка завершена.')

retailers1 = ['Pixi', 'Двоечка', 'Жёлтое и зелёное', 'Экология вкуса', 'Вкусняшка']
vegetables1 = ['Помидоры', 'Огурцы', 'Брюква', 'Баклажаны', 'Патиссоны']

for retailer in retailers1:
    print(retailer)
    for vegetable in vegetables1:
        # Если одновременно выполняются оба условия... 
        if retailer == 'Жёлтое и зелёное' and vegetable == 'Брюква':
            # ...не выполняем текущую итерацию, а сразу переходим к следующей.
            continue
        print(f'- {vegetable} для сети «{retailer}»')

print('Погрузка завершена.')

retailers2 = ['Pixi', 'Двоечка', 'Жёлтое и зелёное', 'Экология вкуса', 'Вкусняшка']
vegetables2 = ['Помидоры', 'Огурцы', 'Брюква', 'Баклажаны', 'Патиссоны']

for retailer in retailers2:
    if retailer == 'Экология вкуса':  # Если это условие выполняется...
        break                         # ...прерываем выполнение цикла.
    # В иных случаях продолжаем работать, как работали:
    print(retailer)
    for vegetable in vegetables2:
        if retailer == 'Жёлтое и зелёное' and vegetable == 'Брюква':
            continue
        print(f'- {vegetable} для сети «{retailer}»')

print('Погрузка завершена.')