def func(*args):
    # Если переданы три аргумента - создаём три переменные:
    arg_1, arg_2, arg_3 = args
    # Теперь значения элементов кортежа args 
    # доступны по отдельности в переменных arg_1, arg_2 и arg_3
    
def func1():
    # Если переданы три аргумента - создаём три переменные:
    result_1 = 2
    result_2 = 12
    result_3 = 8506
    return result_1, result_2, result_3

# Вызываем функцию и присваиваем возвращаемое значение переменной call:
call = func1()
# Значением переменной call будет кортеж (2, 12, 8506)