yield_weight = 'Сегодня вы собрали 500 граммов помидоров'
print(str.find(yield_weight, 'граммов'))
# Будет напечатано: 23

# Проверим, что это за 23 вернулось:
print(yield_weight[23])
# Будет напечатано: г (первый символ искомой подстроки)

tomato_motto = 'Помидоры полезны. Помидоры красивые и весёлые.'

cucumber_motto = str.replace(tomato_motto, 'Помидоры', 'Огурцы')
print(cucumber_motto)
# Будет напечатано: Огурцы полезны. Огурцы красивые и весёлые.

# Четвёртым параметром можно указать количество заменяемых значений.
cucumber_motto = str.replace(tomato_motto, 'Помидоры', 'Огурцы', 1)
print(cucumber_motto)
# Будет напечатано: Огурцы полезны. Помидоры красивые и весёлые.

garden_message = ' !! == Помидоры созрели! Урожай великолепен! == !! '
text = str.strip(garden_message, '=! ')
print(text)
# Будет напечатано: Помидоры созрели! Урожай великолепен